# SetIconPushButtonState

## Description
Retrieves the state of the specified Layout Manager icon push button (pressed or not pressed).

```pascal
FUNCTION SetIconPushButtonState(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				bPressed     : BOOLEAN): BOOLEAN;
```

```python
def vs.SetIconPushButtonState(nDialogID, nComponentID, bPressed):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|bPressed|BOOLEAN|   |

## Version
Availability: from VectorWorks13.0

## Category
* Dialogs - Modern